УТ_для_edt/src/Catalogs/CRM_СостоянияИнтересов/CRM_СостоянияИнтересов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_СостоянияИнтересов</name>
  <comment>Сценарии продаж</comment>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ВероятностьСделки</name>
    <comment>Вероятность сделки</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДела</name>
    <type>
      <types>CatalogRef.CRM_ВидыДелВзаимодействий</types>
    </type>
  </attributes>
  <attributes>
    <name>Завершено</name>
    <comment>Состояние завершения интереса</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_УказаниеОжидаемойВыручки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСостояния</name>
    <type>
      <types>EnumRef.CRM_ВидыСостоянияИнтереса</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Офис</name>
    <type>
      <types>CatalogRef.CRM_ОфисыКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_ОбязательноеЗаполнениеКлиента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноеПланированиеАктивности</name>
    <type>
      <types>EnumRef.CRM_ПланируемыеТипыАктивности</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнтерактивноеПланированиеАктивностей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершатьЗапланированныеАктивности</name>
    <type>
      <types>EnumRef.CRM_ЗавершаемыеТипыАктивности</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтборЗавершаемыхАктивностей</name>
    <type>
      <types>EnumRef.CRM_ОтборыЗавершаемыхАктивностей</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьДостигнутыйРезультат</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДобавитьВероятностьВПредставлениеСостояния</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПредопределенногоЭлемента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИндексЦвета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеСоздаватьЗадачу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПоддержка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияСостояния</name>
    <type>
      <types>EnumRef.CRM_КатегорииСостоянийПоддержки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяемыеРеквизитыИнтереса</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяемыеРеквизитыИнтересаПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьРолевуюАдресацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БлокируемыеРеквизитыИнтереса</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>БлокируемыеРеквизитыИнтересаПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОжидаемыйСрокНаЭтапе</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартОписаниеЭтапа</name>
    <comment>//++ #1656 смарт: Фролов 27.02.2023 //Создание механизма отображения необходимых действий менеджером, на каждом этапе обработки Интереса.</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>смартЧасовНаКвалификацию</name>
    <comment>//++ #Б-1184 Фролов //Добавить реквизиты в справочник &quot;CRM_СостоянияИнтересов&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартЧасовНаВыставлениеКП</name>
    <comment>//++ #Б-1184 Фролов //Добавить реквизиты в справочник &quot;CRM_СостоянияИнтересов&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартЧасовНаСогласованиеКП</name>
    <comment>//++ #Б-1184 Фролов //Добавить реквизиты в справочник &quot;CRM_СостоянияИнтересов&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартЧасовНаВыставлениеСчета</name>
    <comment>//++ #Б-1184 Фролов //Добавить реквизиты в справочник &quot;CRM_СостоянияИнтересов&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартЧасовНаОплату</name>
    <comment>//++ #Б-1184 Фролов //Добавить реквизиты в справочник &quot;CRM_СостоянияИнтересов&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТипыУслуг</name>
    <attributes>
      <name>ТипУслуги</name>
      <type>
        <types>CatalogRef.CRM_ТипУслуги</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Подразделения</name>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТипыОбращений</name>
    <attributes>
      <name>ТипОбращения</name>
      <type>
        <types>CatalogRef.CRM_ТипыОбращений</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>смартТипыУслуг</name>
    <attributes>
      <name>ТипУслуги</name>
      <type>
        <types>CatalogRef.CRM_ТипУслуги</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/Enums/CRM_ПланируемыеТипыАктивности/CRM_ПланируемыеТипыАктивности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_ПланируемыеТипыАктивности</name>
  <enumValues>
    <name>Взаимодействие</name>
  </enumValues>
  <enumValues>
    <name>Задача</name>
    <comment>АПК:1208 имя корректное</comment>
  </enumValues>
  <enumValues>
    <name>ВзаимодействиеИЗадача</name>
  </enumValues>
  <enumValues>
    <name>ВзаимодействиеИлиЗадача</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/CRM_ВидыСостоянияИнтереса/CRM_ВидыСостоянияИнтереса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_ВидыСостоянияИнтереса</name>
  <enumValues>
    <name>Первое</name>
  </enumValues>
  <enumValues>
    <name>УспешноеЗавершение</name>
  </enumValues>
  <enumValues>
    <name>НеудачноеЗавершение</name>
  </enumValues>
  <enumValues>
    <name>смартКвалификация</name>
    <comment>//++ #1698 смарт: Фролов 27.03.2024 //Оповещение Маркетинга и Коммерции о результатах обработки интереса менеджером.</comment>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Catalogs/CRM_ТипыОбращений/CRM_ТипыОбращений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_ТипыОбращений</name>
  <predefined>
    <items>
      <name>Интерес</name>
      <description>Интерес</description>
    </items>
    <items>
      <name>Обращение</name>
      <description>Обращение</description>
    </items>
  </predefined>
  <attributes>
    <name>ИндексКартинки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

УТ_для_edt/src/Catalogs/CRM_СостоянияИнтересов/Forms/ФормаНастройкиСостояния/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекПроверяемыеРеквизитыИнтереса = Неопределено;
	Если Параметры.Свойство("Настройки") Тогда
		ЗаполнитьЗначенияСвойств(Объект, Параметры.Настройки);
		ЭтоНовыйОбъект = Ложь;
		Если Параметры.Настройки.Свойство("ЭтоНовыйОбъект", ЭтоНовыйОбъект) И ЭтоНовыйОбъект И Не ЗначениеЗаполнено(Объект.ОбязательноеПланированиеАктивности) Тогда
			Объект.ОбязательноеПланированиеАктивности = Перечисления.CRM_ПланируемыеТипыАктивности.Взаимодействие;
		КонецЕсли;
		Если Параметры.Настройки.Свойство("ПроверяемыеРеквизитыИнтереса") Тогда
			ТекПроверяемыеРеквизитыИнтереса = Параметры.Настройки.ПроверяемыеРеквизитыИнтереса;
		КонецЕсли;
		Если Параметры.Настройки.Свойство("БлокируемыеРеквизитыИнтереса") Тогда
			ТекБлокируемыеРеквизитыИнтереса = Параметры.Настройки.БлокируемыеРеквизитыИнтереса;
		КонецЕсли;
	ИначеЕсли Параметры.Свойство("Ссылка") Тогда
		ТекПроверяемыеРеквизитыИнтереса = Параметры.Ссылка.ПроверяемыеРеквизитыИнтереса.Получить();
		ТекБлокируемыеРеквизитыИнтереса = Параметры.Ссылка.БлокируемыеРеквизитыИнтереса.Получить();
		ЗначениеВРеквизитФормы(Параметры.Ссылка.ПолучитьОбъект(), "Объект");
		ЗаписыватьОбъект = Истина;
	КонецЕсли;
	
	ЭтоПоддержка = (Объект.Родитель.ЭтоПоддержка);
	Элементы.КатегорияСостояния.Видимость = ЭтоПоддержка;
	Элементы.ГруппаВеротяность.Видимость = Не ЭтоПоддержка;
	Элементы.ОжидаемыйСрокНаЭтапе.Видимость = Не ЭтоПоддержка И Не Объект.Завершено;
	Если ЭтоПоддержка Тогда
		Элементы.ИнтерактивноеПланированиеАктивностей.Заголовок =
			НСтр("ru = 'Планировать дела при изменении состояния обращения в АРМ ""Поддержка""'");
	КонецЕсли;
	
	Элементы.НеСоздаватьЗадачу.Видимость = (Объект.ВидСостояния = Перечисления.CRM_ВидыСостоянияИнтереса.Первое);
	
	Заголовок = НСтр("ru='Настройка состояния';en='Stage Settings'")+": "+Объект.Наименование;
	
	УправлениеВидимостьюЭлементов(ЭтотОбъект);
	
	Если Объект.ВидСостояния = Перечисления.CRM_ВидыСостоянияИнтереса.УспешноеЗавершение 
	 Или Объект.ВидСостояния = Перечисления.CRM_ВидыСостоянияИнтереса.НеудачноеЗавершение Тогда
		Элементы.ГруппаОбязательноеПланирование.Видимость = Ложь; 	 
	КонецЕсли;
	
	ЗаполнитьПроверяемыеРеквизитыИнтереса(ЭтоПоддержка, ТекПроверяемыеРеквизитыИнтереса, ТекБлокируемыеРеквизитыИнтереса);
 
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ПроверяемыеРеквизитыИнтереса = Новый ХранилищеЗначения(МассивПроверяемыхРеквизитов);
	ТекущийОбъект.БлокируемыеРеквизитыИнтереса = Новый ХранилищеЗначения(МассивБлокируемыхРеквизитов);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ОбновитьПовторноИспользуемыеЗначения();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИндексЦветаНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОповещениеНовое = Новый ОписаниеОповещения("ЦветНачалоВыбораЗавершение", ЭтотОбъект);
	ПараметрыФормы = Новый Структура("ТекущийЦвет", Объект.ИндексЦвета);
	ФормаВыбораЦвета = ОткрытьФорму("Справочник.CRM_Категории.Форма.ФормаВыбораЦвета", ПараметрыФормы, Элемент,,,,
		ОповещениеНовое, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	
КонецПроцедуры // ЦветНачалоВыбора()

&НаКлиенте
// Продолжение процедуры "ЦветНачалоВыбора"
//
Процедура ЦветНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если НЕ (Результат = Неопределено) И НЕ (Результат = КодВозвратаДиалога.Отмена) Тогда
		Объект.ИндексЦвета = Результат[0].Картинка;
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗавершатьЗапланированныеАктивностиПриИзменении(Элемент)
	Если НЕ ЗначениеЗаполнено(Объект.ЗавершатьЗапланированныеАктивности) И Объект.УказыватьДостигнутыйРезультат Тогда
		Объект.УказыватьДостигнутыйРезультат = Ложь;
	КонецЕсли;
	УправлениеВидимостьюЭлементов(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Готово(Команда)
	
	Если ЭтоПоддержка И Объект.КатегорияСостояния.Пустая() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.ПутьКДанным = "КатегорияСостояния";
		Сообщение.Текст = НСтр("ru='Не заполнена категория !'");
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;	
	МассивПроверяемыхРеквизитовТемп = Новый Массив;
	МассивБлокируемыхРеквизитовТемп = Новый Массив;
	Для каждого Строка из ПроверяемыеРеквизитыИнтереса Цикл
		Если Строка.ПроверкаЗаполнения Тогда
			МассивПроверяемыхРеквизитовТемп.Добавить(Строка.Реквизит);
		КонецЕсли;
		Если Строка.ТолькоПросмотр Тогда
			МассивБлокируемыхРеквизитовТемп.Добавить(Строка.Реквизит);
		КонецЕсли;
	КонецЦикла;
	МассивПроверяемыхРеквизитов = Новый ФиксированныйМассив(МассивПроверяемыхРеквизитовТемп);
	МассивБлокируемыхРеквизитов = Новый ФиксированныйМассив(МассивБлокируемыхРеквизитовТемп);
	
	Если ЗаписыватьОбъект Тогда
		Записать();
	КонецЕсли;
	
	Настройки = Новый Структура;
	Настройки.Вставить("ПроверяемыеРеквизитыИнтереса", МассивПроверяемыхРеквизитов);
	Настройки.Вставить("БлокируемыеРеквизитыИнтереса", МассивБлокируемыхРеквизитов);
	Настройки.Вставить("ОбязательноеПланированиеАктивности", Объект.ОбязательноеПланированиеАктивности);
	Настройки.Вставить("ИнтерактивноеПланированиеАктивностей", Объект.ИнтерактивноеПланированиеАктивностей);
	Настройки.Вставить("ЗавершатьЗапланированныеАктивности", Объект.ЗавершатьЗапланированныеАктивности);
	Настройки.Вставить("ОтборЗавершаемыхАктивностей", Объект.ОтборЗавершаемыхАктивностей);
	Настройки.Вставить("УказыватьДостигнутыйРезультат", Объект.УказыватьДостигнутыйРезультат);
	Настройки.Вставить("РазрешитьРолевуюАдресацию", Объект.РазрешитьРолевуюАдресацию);
	Настройки.Вставить("ДобавитьВероятностьВПредставлениеСостояния", Объект.ДобавитьВероятностьВПредставлениеСостояния);
	Настройки.Вставить("ВероятностьСделки", Объект.ВероятностьСделки);
	Настройки.Вставить("ИндексЦвета", Объект.ИндексЦвета);
	Закрыть(Настройки);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеВидимостьюЭлементов(Форма)
		
	Форма.Элементы.УказыватьДостигнутыйРезультат.Видимость = ЗначениеЗаполнено(Форма.Объект.ЗавершатьЗапланированныеАктивности); 
	Форма.Элементы.ОтборЗавершаемыхАктивностей.Видимость = ЗначениеЗаполнено(Форма.Объект.ЗавершатьЗапланированныеАктивности);
	Форма.Элементы.ОтборЗавершаемыхАктивностей.АвтоОтметкаНезаполненного = ЗначениеЗаполнено(Форма.Объект.ЗавершатьЗапланированныеАктивности);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПроверяемыеРеквизитыИнтереса(ЭтоПоддержка, ТекПроверяемыеРеквизитыИнтереса, ТекБлокируемыеРеквизитыИнтереса)
	
	РеквизитМД = Метаданные.Документы.CRM_Интерес.Реквизиты.Найти("Партнер");
	Если РеквизитМД <> Неопределено Тогда
		НовСтр = ПроверяемыеРеквизитыИнтереса.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, Новый Структура("Реквизит, Синоним", "Партнер", РеквизитМД.Синоним));
	КонецЕсли;
	Если НЕ ЭтоПоддержка Тогда
		РеквизитМД = Метаданные.Документы.CRM_Интерес.Реквизиты.Найти("ОжидаемаяВыручка");
		Если РеквизитМД <> Неопределено Тогда
			НовСтр = ПроверяемыеРеквизитыИнтереса.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, Новый Структура("Реквизит, Синоним", "ОжидаемаяВыручка", РеквизитМД.Синоним));
		КонецЕсли;
		РеквизитМД = Метаданные.Документы.CRM_Интерес.Реквизиты.Найти("ОжидаемаяДатаПродажи");
		Если РеквизитМД <> Неопределено Тогда
			НовСтр = ПроверяемыеРеквизитыИнтереса.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, Новый Структура("Реквизит, Синоним", "ОжидаемаяДатаПродажи", РеквизитМД.Синоним));
		КонецЕсли;
	КонецЕсли;
	РеквизитМД = Метаданные.Документы.CRM_Интерес.Реквизиты.Найти("Договор");
	Если РеквизитМД <> Неопределено Тогда
		НовСтр = ПроверяемыеРеквизитыИнтереса.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, Новый Структура("Реквизит, Синоним", "Договор", РеквизитМД.Синоним));
	КонецЕсли;
	РеквизитМД = Метаданные.Документы.CRM_Интерес.Реквизиты.Найти("Соглашение");
	Если РеквизитМД <> Неопределено Тогда
		НовСтр = ПроверяемыеРеквизитыИнтереса.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, Новый Структура("Реквизит, Синоним", "Соглашение", РеквизитМД.Синоним));
	КонецЕсли;
	РеквизитМД = Метаданные.Документы.CRM_Интерес.Реквизиты.Найти("Контрагент");
	Если РеквизитМД <> Неопределено Тогда
		НовСтр = ПроверяемыеРеквизитыИнтереса.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, Новый Структура("Реквизит, Синоним", "Контрагент", РеквизитМД.Синоним));
	КонецЕсли;
	РеквизитМД = Метаданные.Документы.CRM_Интерес.Реквизиты.Найти("Организация");
	Если РеквизитМД <> Неопределено Тогда
		НовСтр = ПроверяемыеРеквизитыИнтереса.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, Новый Структура("Реквизит, Синоним", "Организация", РеквизитМД.Синоним));
	КонецЕсли;
	РеквизитМД = Метаданные.Документы.CRM_Интерес.Реквизиты.Найти("Проект");
	Если РеквизитМД <> Неопределено Тогда
		НовСтр = ПроверяемыеРеквизитыИнтереса.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, Новый Структура("Реквизит, Синоним", "Проект", РеквизитМД.Синоним));
	КонецЕсли;
	РеквизитМД = Метаданные.Документы.CRM_Интерес.Реквизиты.Найти("Описание");
	Если РеквизитМД <> Неопределено Тогда
		НовСтр = ПроверяемыеРеквизитыИнтереса.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, Новый Структура("Реквизит, Синоним", "Описание", РеквизитМД.Синоним));
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Свойство КАК Свойство,
	                      |	НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Свойство.Заголовок КАК СвойствоЗаголовок
	                      |ИЗ
	                      |	Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеРеквизиты КАК НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты
	                      |ГДЕ
	                      |	НЕ НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Свойство.ПометкаУдаления
	                      |	И НЕ НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.ПометкаУдаления
	                      |	И НЕ НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Ссылка.ПометкаУдаления
	                      |	И НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Ссылка В (&Наборы)");
	Запрос.УстановитьПараметр("Наборы", ПолучитьНаборыСвойствДляИнтересов());
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НовСтр = ПроверяемыеРеквизитыИнтереса.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, Новый Структура("Реквизит, Синоним", Выборка.Свойство, Выборка.СвойствоЗаголовок));
	КонецЦикла;
	
	Если ТекПроверяемыеРеквизитыИнтереса<>Неопределено ИЛИ ТекБлокируемыеРеквизитыИнтереса<>Неопределено Тогда
		Для каждого Строка из ПроверяемыеРеквизитыИнтереса Цикл
			Если ТекПроверяемыеРеквизитыИнтереса<>Неопределено
				И ТекПроверяемыеРеквизитыИнтереса.Найти(Строка.Реквизит)<>Неопределено Тогда
				Строка.ПроверкаЗаполнения = Истина;
			КонецЕсли;
			Если ТекБлокируемыеРеквизитыИнтереса<>Неопределено
				И ТекБлокируемыеРеквизитыИнтереса.Найти(Строка.Реквизит)<>Неопределено Тогда
				Строка.ТолькоПросмотр = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНаборыСвойствДляИнтересов()
	Наборы = Новый СписокЗначений;
	Если Объект.Родитель.ТипыОбращений.Количество()>0 Тогда
		Для каждого Строка из Объект.Родитель.ТипыОбращений Цикл
			ТипОбращения = Строка.ТипОбращения;
			Если ТипОбращения = Справочники.CRM_ТипыОбращений.Интерес Тогда
				Наборы.Добавить(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_CRM_Интерес_Интерес,    НСтр("ru='Для интересов с типом Интерес'"));
			Иначе
				Наборы.Добавить(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_CRM_Интерес_ВсеОбращения, НСтр("ru='Общие для всех обращений'"));
				Если ТипОбращения = Справочники.CRM_ТипыОбращений.Обращение Тогда
					Наборы.Добавить(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_CRM_Интерес_Обращение,    НСтр("ru='Обращение'"));
				Иначе
					Наборы.Добавить(Справочники.НаборыДополнительныхРеквизитовИСведений.НайтиПоНаименованию(ТипОбращения.Наименование), НСтр("ru='Для интересов с типом'")+ " " + ТипОбращения.Наименование);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Наборы.Добавить(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_CRM_Интерес_Интерес,    НСтр("ru='Для интересов с типом Интерес'"));
	КонецЕсли;
	Возврат Наборы;
КонецФункции // ПолучитьНаборыСвойствДляПартнеров()

#КонецОбласти
